dontek1/esp-serial-flasher/examples/esp32_example/main/main.c
/* Flash multiple partitions example

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include <sys/param.h>
#include <string.h>

#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"

#include "esp32_port.h"
#include "esp_loader.h"

#include "esp_app_format.h"
#include "esp_ota_ops.h"

#include "esp_flash.h"

#include "esp_http_client.h"

#include "driver/uart.h"
#include "driver/gpio.h"

#include "example_common.h"

#include "led_strip.h"

#include "nvs.h"
#include "nvs_flash.h"

#include "protocol_examples_common.h"

static const char *TAG = "serial_flasher";

#define FLASH_BACKUP_APP

//#define ENABLE_UART_CHECK

// Flashing bootloader/partition table from HTTP server not supported/TBD.
#ifndef ENABLE_HTTP_DOWNLOAD
#define ENABLE_FLASH_BOOTLOADER
#define ENABLE_FLASH_PARTTABLE
#endif

#define BOARD_TYPE_DEVKIT   0
#define BOARD_TYPE_SWC      1
#define BOARD_TYPE          BOARD_TYPE_SWC

#if BOARD_TYPE == BOARD_TYPE_DEVKIT

    #define ESP1_UART_NUM       UART_NUM_1
    #define ESP2_UART_NUM       UART_NUM_2

    #define LED_GPIO            GPIO_NUM_38

    #define GPIO_ESP1_RX        GPIO_NUM_11
    #define GPIO_ESP1_TX        GPIO_NUM_12
    #define GPIO_ESP1_RST       GPIO_NUM_6
    #define GPIO_ESP1_GPIO0     GPIO_NUM_7

    #define GPIO_ESP2_RX        GPIO_NUM_17
    #define GPIO_ESP2_TX        GPIO_NUM_18
    #define GPIO_ESP2_RST       GPIO_NUM_4
    #define GPIO_ESP2_GPIO0     GPIO_NUM_5

    #define GPIO_INPUT_ESPn     GPIO_NUM_14

    #define GPIO_INPUT_BAUD1    GPIO_NUM_45
    #define GPIO_INPUT_BAUD2    GPIO_NUM_48
    #define GPIO_INPUT_BAUD3    GPIO_NUM_47
    #define GPIO_INPUT_BAUD4    GPIO_NUM_21

    #define GPIO_INPUT_URL      GPIO_NUM_1

    #define GPIO_INPUT_PIN_SEL  ((1ULL<<GPIO_INPUT_ESPn)\
                                |(1ULL<<GPIO_INPUT_BAUD1)\
                                |(1ULL<<GPIO_INPUT_BAUD2)\
                                |(1ULL<<GPIO_INPUT_BAUD3)\
                                |(1ULL<<GPIO_INPUT_BAUD4)\
                                |(1ULL<<GPIO_INPUT_URL))

#elif BOARD_TYPE == BOARD_TYPE_SWC

    #define ESP1_UART_NUM       UART_NUM_1      // Power Board
    #define ESP2_UART_NUM       UART_NUM_2      // IO Board

    #define LED_GPIO            GPIO_NUM_1

    #define GPIO_ESP1_RX        GPIO_NUM_5
    #define GPIO_ESP1_TX        GPIO_NUM_4
    #define GPIO_ESP1_RST       GPIO_NUM_6
    #define GPIO_ESP1_GPIO0     GPIO_NUM_7

    #define GPIO_ESP2_RX        GPIO_NUM_16
    #define GPIO_ESP2_TX        GPIO_NUM_15
    #define GPIO_ESP2_RST       GPIO_NUM_17
    #define GPIO_ESP2_GPIO0     GPIO_NUM_18

    #define GPIO_INPUT_ESPn     GPIO_NUM_8

    #define GPIO_INPUT_BAUD1    GPIO_NUM_9
    #define GPIO_INPUT_BAUD2    GPIO_NUM_10

    #define GPIO_INPUT_URL      GPIO_NUM_11

    #define GPIO_INPUT_PIN_SEL  ((1ULL<<GPIO_INPUT_ESPn)\
                                |(1ULL<<GPIO_INPUT_BAUD1)\
                                |(1ULL<<GPIO_INPUT_BAUD2)\
                                |(1ULL<<GPIO_INPUT_URL))

#else

    #error "Please select the board type"

#endif

#define BAUD_RATE_DEF      115200

static loader_esp32_config_t config =
{
    .baud_rate = BAUD_RATE_DEF
};

static uint32_t higher_baudrate = BAUD_RATE_DEF;

static led_strip_handle_t led_strip;

// white
static uint8_t R = 0x10;
static uint8_t G = 0x10;
static uint8_t B = 0x10;

enum blink_rate_e
{
    BLINK_RATE_DEF=0,
    BLINK_RATE_115K,
    BLINK_RATE_230K,
    BLINK_RATE_460K,
    BLINK_RATE_921K,
    BLINK_RATE_368M,
    BLINK_RATE_ERR
};

static uint8_t blink_rate = BLINK_RATE_DEF;

#define LED_SET_ESP1()          do { R=0x00; G=0x00; B=0x80; } while(0)                     // blue -> Power Board
#define LED_SET_ESP2()          do { R=0xFF; G=0x45; B=0x00; } while(0)                     // orange -> IO Board

#define LED_SET_CONNECTED()     do { R=0x00; G=0x80; B=0x00; } while(0)                     // green        
#define LED_SET_ERROR(r,g,b)    do { R=r; G=g; B=b; blink_rate=BLINK_RATE_ERR; } while(0)

#define LED_FILE_ERROR()        LED_SET_ERROR(0x80,0x80,0x00)                               // yellow
#define LED_TARGET_ERROR()      LED_SET_ERROR(0x80,0x00,0x80)                               // purple             
#define LED_FLASH_ERROR()       LED_SET_ERROR(0x80,0x00,0x00)                               // red                

static void led_configure(void)
{
    led_strip_config_t strip_config =
    {
        .strip_gpio_num = LED_GPIO,
        .max_leds = 1,
    };
    led_strip_rmt_config_t rmt_config =
    {
        .resolution_hz = 10 * 1000 * 1000, // 10MHz
        .flags.with_dma = false,
    };
    ESP_ERROR_CHECK(led_strip_new_rmt_device(&strip_config, &rmt_config, &led_strip));
    led_strip_clear(led_strip);
}

void led_blink(void *arg)
{
    bool led_state = true;
    uint32_t led_intv_ms = 1000;

    while(1)
    {
        if(led_state)
        {
            led_strip_set_pixel(led_strip, 0, R, G, B);
            led_strip_refresh(led_strip);
            led_state = false;
        }
        else
        {
            led_strip_clear(led_strip);
            led_state = true;
        }

        switch(blink_rate)
        {
            case BLINK_RATE_368M: led_intv_ms = 25; break;
            case BLINK_RATE_921K: led_intv_ms = 125; break;
            case BLINK_RATE_460K: led_intv_ms = 250; break;
            case BLINK_RATE_230K: led_intv_ms = 500; break;
            case BLINK_RATE_115K: led_intv_ms = 1000; break;
            case BLINK_RATE_ERR: led_intv_ms = 5000; break;
            default: led_intv_ms = 2000; break; // BLINK_RATE_DEF
        }

        vTaskDelay(pdMS_TO_TICKS(led_intv_ms));
    }
}

// Max line size
#define SLV_BUF_LEN 128
static uint8_t slv_buf[SLV_BUF_LEN] = {0};

void slave_monitor(void *arg)
{
    if(higher_baudrate != BAUD_RATE_DEF)
    {
        uart_flush_input(config.uart_port);
        uart_flush(config.uart_port);
        uart_set_baudrate(config.uart_port, BAUD_RATE_DEF);
    }

    while(1)
    {
        int rxBytes = uart_read_bytes(config.uart_port, slv_buf, SLV_BUF_LEN, 100 / portTICK_PERIOD_MS);
        slv_buf[rxBytes] = '\0';
        printf("%s", slv_buf);
    }
}

static void gpio_setup(void)
{
    //zero-initialize the config structure.
    gpio_config_t io_conf = {};
    //disable interrupt
    io_conf.intr_type = GPIO_INTR_DISABLE;
    //bit mask of the pins
    io_conf.pin_bit_mask = GPIO_INPUT_PIN_SEL;
    //set as input mode
    io_conf.mode = GPIO_MODE_INPUT;
    //enable pull-up mode
    io_conf.pull_up_en = 1;
    gpio_config(&io_conf);
}

static void gpio_select_esp(void)
{
    // GND --- IN.ESPn => select ESP
    int inEsp = gpio_get_level(GPIO_INPUT_ESPn);
    ESP_LOGI(TAG, "Get GPIO%d = %d -> connect to %s board", GPIO_INPUT_ESPn, inEsp, inEsp ? "PWR" : "IO");
    
    if(inEsp == 1)
    {
        config.uart_port = ESP1_UART_NUM;
        config.uart_rx_pin = GPIO_ESP1_RX;
        config.uart_tx_pin = GPIO_ESP1_TX;
        config.reset_trigger_pin = GPIO_ESP1_RST;
        config.gpio0_trigger_pin = GPIO_ESP1_GPIO0;
        LED_SET_ESP1();
    }
    else // 0
    {
        config.uart_port = ESP2_UART_NUM;
        config.uart_rx_pin = GPIO_ESP2_RX;
        config.uart_tx_pin = GPIO_ESP2_TX;
        config.reset_trigger_pin = GPIO_ESP2_RST;
        config.gpio0_trigger_pin = GPIO_ESP2_GPIO0;
        LED_SET_ESP2();
    }
}

static void gpio_select_baud(void)
{
#if BOARD_TYPE == BOARD_TYPE_DEVKIT
    // GND --- IN.Baud1-4 => select baud
    int inBaud1 = gpio_get_level(GPIO_INPUT_BAUD1);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD1, inBaud1);

    int inBaud2 = gpio_get_level(GPIO_INPUT_BAUD2);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD2, inBaud2);

    int inBaud3 = gpio_get_level(GPIO_INPUT_BAUD3);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD3, inBaud3);

    int inBaud4 = gpio_get_level(GPIO_INPUT_BAUD4);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD4, inBaud4);

    if(inBaud4 == 0)
    {
        higher_baudrate = 3686400;
        blink_rate = BLINK_RATE_368M;
    }
    else if(inBaud3 == 0)
    {
        higher_baudrate = 921600;
        blink_rate = BLINK_RATE_921K;
    }
    else if(inBaud2 == 0)
    {
        higher_baudrate = 460800;
        blink_rate = BLINK_RATE_460K;
    }
    else if(inBaud1 == 0)
    {
        higher_baudrate = 230400;
        blink_rate = BLINK_RATE_230K;
    }
    else
    {
        higher_baudrate = BAUD_RATE_DEF;
        blink_rate = BLINK_RATE_115K;
    }
#else
    // GND --- IN.Baud1-4 => select baud
    int inBaud1 = gpio_get_level(GPIO_INPUT_BAUD1);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD1, inBaud1);

    int inBaud2 = gpio_get_level(GPIO_INPUT_BAUD2);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_BAUD2, inBaud2);

    if(inBaud1 == 1 && inBaud2 == 1)
    {
        higher_baudrate = 921600;
        blink_rate = BLINK_RATE_921K;
    }
    else if(inBaud1 == 1 && inBaud2 == 0)
    {
        higher_baudrate = 460800;
        blink_rate = BLINK_RATE_460K;
    }
    else if(inBaud1 == 0 && inBaud2 == 1)
    {
        higher_baudrate = 230400;
        blink_rate = BLINK_RATE_230K;
    }
    else
    {
        higher_baudrate = BAUD_RATE_DEF;
        blink_rate = BLINK_RATE_115K;        
    }
#endif
}

#ifdef ENABLE_UART_CHECK
static void uart_check(uint32_t uart_port, uint32_t tx_pin, uint32_t rx_pin)
{
    uart_config_t uart_config =
    {
        .baud_rate = BAUD_RATE_DEF,
        .data_bits = UART_DATA_8_BITS,
        .parity    = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    ESP_ERROR_CHECK(uart_driver_install(uart_port, SLV_BUF_LEN * 2, 0, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_param_config(uart_port, &uart_config));
    ESP_ERROR_CHECK(uart_set_pin(uart_port, tx_pin, rx_pin, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));

    ESP_LOGI(TAG, "UART%lu opened, baud %dbps", uart_port, uart_config.baud_rate);

    for(int i = 0; i < 30; i++)
    {
        // Read data from the UART
        int len = uart_read_bytes(uart_port, slv_buf, (SLV_BUF_LEN - 1), 20 / portTICK_PERIOD_MS);
        if(len)
        {
            slv_buf[len] = '\0';
            ESP_LOGI(TAG, "Recv str: %s", (char *) slv_buf);
        }
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    ESP_ERROR_CHECK(uart_driver_delete(uart_port));
}
#endif

#ifdef SINGLE_TARGET_SUPPORT

// For esp32s3 and later chips
#define BOOTLOADER_ADDRESS_V1       0x0
#define PARTITION_ADDRESS           0x8000
#define APP_MAIN_ADDRESS            0x10000
#define APP_BKUP_ADDRESS            0x290000

