dontek1/esp-serial-flasher/examples/esp32_example/main/main.c
void init_binaries_esp32s3(example_binaries_t *bins)
{
    bins->boot.data = NULL;
    bins->boot.size = 0;
    bins->boot.addr = BOOTLOADER_ADDRESS_V1;

    bins->part.data = NULL;
    bins->part.size = 0;
    bins->part.addr = PARTITION_ADDRESS;

    bins->app.data  = NULL;
    bins->app.size  = 0;
    #ifdef FLASH_BACKUP_APP    
    bins->app.addr  = APP_BKUP_ADDRESS;
    #else
    bins->app.addr  = APP_MAIN_ADDRESS;
    #endif
}

#ifdef ENABLE_HTTP_DOWNLOAD

#define DOWNLOAD_ADDRESS    (0x00281000)
#define DOWNLOAD_PROGRESS   (10)

esp_partition_mmap_handle_t download_map_handle;
const void *download_map_ptr;
bool download_mapped = false;

#define DLD_BUF_SIZE 8192
static char download_buf[DLD_BUF_SIZE+1] = {0};

static void http_cleanup(esp_http_client_handle_t client)
{
    esp_http_client_close(client);
    esp_http_client_cleanup(client);
}

char *http_url = NULL;
static void gpio_select_url(void)
{
    // GND --- IN.URL => select url
    int inUrl = gpio_get_level(GPIO_INPUT_URL);
    ESP_LOGI(TAG, "Get GPIO%d = %d", GPIO_INPUT_URL, inUrl);

    if(inUrl == 1)
    {
        http_url = "http://example.com/file1.bin";
    }
    else
    {
        http_url = "http://example.com/file2.bin";
    }
}

bool get_binaries_esp32s3(example_binaries_t *bins)
{
    bool result = false;

    init_binaries_esp32s3(bins);    
    gpio_select_url();

    int64_t t0_us = esp_timer_get_time();
    int64_t t1_us = 0;
    int64_t tm_us = 0;
    double tm_sec = 0.0;

    esp_http_client_config_t config =
    {
        .url = http_url,
        .cert_pem = NULL,
        .timeout_ms = 3000,
        .keep_alive_enable = true,
        .skip_cert_common_name_check = true
    };

    esp_http_client_handle_t client = esp_http_client_init(&config);
    if(client == NULL)
    {
        ESP_LOGE(TAG, "Failed to initialise HTTP connection");
        return result;
    }
    ESP_LOGI(TAG, "HTTP connection initialised");

    esp_err_t err = esp_http_client_open(client, 0);
    if(err != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to open HTTP connection: %s", esp_err_to_name(err));
        esp_http_client_cleanup(client);
        return result;
    }
    ESP_LOGI(TAG, "HTTP connection opened, URL: %s", config.url);

    int64_t cont_len = esp_http_client_fetch_headers(client);
    if(cont_len > 0)
    {
        ESP_LOGI(TAG, "content-length is %lld", cont_len);
    }

    int bin_len = 0;
    int pct_read = 0;
    int pct_old = -1;    

    bool image_header_was_checked = false;
    
    uint32_t write_address = DOWNLOAD_ADDRESS;

    while(1)
    {
        int data_read = esp_http_client_read(client, download_buf, DLD_BUF_SIZE);
        if(data_read < 0)
        {
            ESP_LOGE(TAG, "Error: SSL data read error");
            http_cleanup(client);
            break;
        }
        else if(data_read > 0)
        {
            if(image_header_was_checked == false)
            {
                esp_app_desc_t new_app_info;
                if(data_read > sizeof(esp_image_header_t) + sizeof(esp_image_segment_header_t) + sizeof(esp_app_desc_t))
                {
                    memcpy(&new_app_info, &download_buf[sizeof(esp_image_header_t) + sizeof(esp_image_segment_header_t)], sizeof(esp_app_desc_t));
                    if(new_app_info.magic_word == ESP_APP_DESC_MAGIC_WORD)
                    {
                        ESP_LOGI(TAG, "Firmware info");
                        ESP_LOGI(TAG, "- project name: %s", new_app_info.project_name);
                        ESP_LOGI(TAG, "- firmware version: %s", new_app_info.version);
                        ESP_LOGI(TAG, "- IDF version: %s", new_app_info.idf_ver);
                        ESP_LOGI(TAG, "- compiled date/time: %s %s", new_app_info.date, new_app_info.time);
                        
                        image_header_was_checked = true;
                    }
                    else
                    {
                        ESP_LOGE(TAG, "Invalid magic word: %lx", new_app_info.magic_word);
                        http_cleanup(client);
                        break;
                    }
                }
                else
                {
                    ESP_LOGE(TAG, "Received package is not fit len");
                    http_cleanup(client);
                    break;
                }
            }
            
	        err = esp_flash_erase_region(NULL, write_address, DLD_BUF_SIZE);
            if(err != ESP_OK)
            {
                ESP_LOGE(TAG, "Error erasing flash address at 0x%lu, size=%d", write_address, DLD_BUF_SIZE);
                break;
            }

            err = esp_flash_write(NULL, (void *) download_buf, write_address, data_read);
            if(err != ESP_OK)
            {
                ESP_LOGE(TAG, "Error writing %d bytes to flash address 0x%lu", data_read, write_address);
                break;
            }

            write_address += data_read;
            bin_len += data_read;
            ESP_LOGD(TAG, "Written image length %d", bin_len);

            if(cont_len > 0)
            {
                pct_read = (bin_len * 100) / cont_len;
                pct_read = pct_read - (pct_read % DOWNLOAD_PROGRESS);

                if(pct_read != pct_old)
                {
                    pct_old = pct_read;
                    t1_us = esp_timer_get_time();
                    tm_us = t1_us - t0_us;    
                    tm_sec = (double) (tm_us / 1000000.0);
                    double kBs = (double) ((bin_len / 1024) / tm_sec);
                    ESP_LOGI(TAG, "Downloading & writing to flash %d%% (%.1f kB/s)", pct_read, kBs);

                    if(kBs > 50) blink_rate = BLINK_RATE_368M;
                    else if(kBs > 40) blink_rate = BLINK_RATE_921K;
                    else if(kBs > 30) blink_rate = BLINK_RATE_460K;
                    else if(kBs > 20) blink_rate = BLINK_RATE_230K;
                    else if(kBs > 10) blink_rate = BLINK_RATE_115K;
                    else blink_rate = BLINK_RATE_DEF;
                }
            }
        }
        else if(data_read == 0)
        {
           /*
            * As esp_http_client_read never returns negative error code, we rely on
            * `errno` to check for underlying transport connectivity closure if any
            */
            if(errno == ECONNRESET || errno == ENOTCONN)
            {
                ESP_LOGE(TAG, "Connection closed, errno = %d", errno);
                break;
            }
            if(esp_http_client_is_complete_data_received(client) == true)
            {
                ESP_LOGI(TAG, "Connection closed");
                break;
            }
        }
    }

