dontek1/esp-serial-flasher/examples/esp32_example/main/main.c
    result = esp_http_client_is_complete_data_received(client);
    if(result)
    {
        if(bin_len > 0)
        {
            t1_us = esp_timer_get_time();
            tm_us = t1_us - t0_us;    
            tm_sec = (double) (tm_us / 1000000.0);
            ESP_LOGI(TAG, "Downloaded & wrote %d bytes to flash in %.1f secs", bin_len, tm_sec);

            const esp_partition_t *partition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "download");
            if(partition != NULL)
            {
                err = esp_partition_mmap(partition, 0, partition->size, ESP_PARTITION_MMAP_DATA, &download_map_ptr, &download_map_handle);
                if(err == ESP_OK)
                {
                    ESP_LOGI(TAG, "'download' partition mapped to data memory address %p", download_map_ptr);
                    bins->app.data = (const uint8_t *) download_map_ptr;
                    bins->app.size = bin_len;
                    download_mapped = true;
                }
                else
                {
                    ESP_LOGE(TAG, "esp_partition_mmap returned %d", err);
                    result = false;
                }
            }
            else
            {
                ESP_LOGE(TAG, "'download' partition is NULL");
                result = false;
            }
        }
        else
        {
            ESP_LOGW(TAG, "No data downloaded/flashed");
        }
    }
    else
    {
        ESP_LOGE(TAG, "Error in receiving complete file");
    }

    return result;
}

#else // !ENABLE_HTTP_DOWNLOAD

extern const unsigned char bootloader_start[] asm("_binary_bootloader_bin_start");
extern const unsigned char bootloader_end[]   asm("_binary_bootloader_bin_end");

extern const unsigned char partition_table_start[] asm("_binary_partition_table_bin_start");
extern const unsigned char partition_table_end[]   asm("_binary_partition_table_bin_end");

extern const unsigned char https_mbedtls_start[] asm("_binary_https_mbedtls_bin_start");
extern const unsigned char https_mbedtls_end[]   asm("_binary_https_mbedtls_bin_end");

bool get_binaries_esp32s3(example_binaries_t *bins)
{
    init_binaries_esp32s3(bins);
    
    bins->boot.data = (const uint8_t *) &bootloader_start;
    bins->boot.size = bootloader_end - bootloader_start;

    bins->part.data = (const uint8_t *) &partition_table_start;
    bins->part.size = partition_table_end - partition_table_start;

    bins->app.data  = (const uint8_t *) &https_mbedtls_start;
    bins->app.size  = https_mbedtls_end - https_mbedtls_start;

    return true;
}

#endif // ENABLE_HTTP_DOWNLOAD

#endif // SINGLE_TARGET_SUPPORT

static bool do_flash(const char *name, const uint8_t *bin, size_t size, size_t address)
{
    bool result = false;

    if(bin == NULL)
    {
        ESP_LOGE(TAG, "Invalid bin data for %s", name);
    }
    else if(size == 0)
    {
        ESP_LOGE(TAG, "Invalid bin size for %s", name);
    }
    else
    {
        ESP_LOGI(TAG, "Loading %s from %p to 0x%08x...", name, bin, address);
        ESP_LOGI(TAG, "Baud: %lu", higher_baudrate);
        ESP_LOGI(TAG, "Size: %d bytes", size);

        int64_t t0_us = esp_timer_get_time();
        esp_loader_error_t err = flash_binary(bin, size, address);
        int64_t t1_us = esp_timer_get_time();
        
        if(err == ESP_LOADER_SUCCESS)
        {
            int64_t tm_us = t1_us - t0_us;    
            double tm_sec = (double) (tm_us / 1000000.0);
            double size_kb = (double) (size / 1024.0);
            double kb_s = size_kb / tm_sec;

            ESP_LOGI(TAG, "Time: %.1f secs", tm_sec);
            ESP_LOGI(TAG, "Rate: %.1f kB/s\n", kb_s);
            result = true;
        }
        else
        {
            ESP_LOGE(TAG, "Error flashing %s: %d", name, err);
        }
    }

    return result;
}

void app_main(void)
{
    bool result = false;

    gpio_setup();

    led_configure();
    xTaskCreate(led_blink, "led_blink", 2048, NULL, configMAX_PRIORITIES - 1, NULL);

#ifdef ENABLE_HTTP_DOWNLOAD
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // OTA app partition table has a smaller NVS partition size than the non-OTA
        // partition table. This size mismatch may cause NVS initialization to fail.
        // If this happens, we erase NVS partition and initialize NVS again.
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    /* This helper function configures Wi-Fi or Ethernet, as selected in menuconfig.
     * Read "Establishing Wi-Fi or Ethernet Connection" section in
     * examples/protocols/README.md for more information about this function.
     */
    ESP_ERROR_CHECK(example_connect());
    LED_SET_CONNECTED();
#endif

    example_binaries_t bin;
#ifdef SINGLE_TARGET_SUPPORT        
    result = get_binaries_esp32s3(&bin);
    if(!result)
    {
        ESP_LOGE(TAG, "error getting binaries.");
        LED_FILE_ERROR();
        return;
    }    
#else
    get_example_binaries(esp_loader_get_target(), &bin);
#endif

    gpio_select_esp();

#ifdef ENABLE_UART_CHECK
    uart_check(config.uart_port, config.uart_tx_pin, config.uart_rx_pin);
#endif

    if(loader_port_esp32_init(&config) != ESP_LOADER_SUCCESS)
    {
        ESP_LOGE(TAG, "serial initialization failed.");
        LED_TARGET_ERROR();
        return;
    }

    gpio_select_baud();
    ESP_LOGI(TAG, "Connecting on UART%lu", config.uart_port);

    result = (connect_to_target(higher_baudrate) == ESP_LOADER_SUCCESS);
    if(result)
    {
#if 1
        // Not necessary, just to demonstrate the erase functions
        esp_loader_error_t erase_err = esp_loader_flash_erase();
        if(erase_err != ESP_LOADER_SUCCESS)
		{
            ESP_LOGE(TAG, "Failed to erase flash");
            return;
        }
#endif
		
#ifdef ENABLE_FLASH_BOOTLOADER
        result &= do_flash("bootloader", bin.boot.data, bin.boot.size, bin.boot.addr);
#endif

#ifdef ENABLE_FLASH_PARTTABLE
        result &= do_flash("partition table", bin.part.data, bin.part.size, bin.part.addr);
#endif

#if 1
		// Not necessary, just to demonstrate the erase functions
        esp_loader_error_t erase_reg_err = esp_loader_flash_erase_region(0, 0x1000);
        if(erase_reg_err != ESP_LOADER_SUCCESS)
		{
            ESP_LOGE(TAG, "Failed to erase flash region");
            return;
        }
#endif

        result &= do_flash("app", bin.app.data,  bin.app.size,  bin.app.addr);
        if(result)
        {
            ESP_LOGI(TAG, "Success!");
            blink_rate = BLINK_RATE_DEF;
        }
        else
        {
            LED_FLASH_ERROR();
        }

#ifdef ENABLE_HTTP_DOWNLOAD
        if(download_mapped)
        {
            esp_partition_munmap(download_map_handle);
        }
#endif




        get_example_binaries(esp_loader_get_target(), &bin);


        esp_loader_reset_target();

        // Delay for skipping the boot message of the targets
        vTaskDelay(pdMS_TO_TICKS(500));

        // Forward slave's serial output
        ESP_LOGI(TAG, "********************************************");
        ESP_LOGI(TAG, "*** Logs below are print from slave .... ***");
        ESP_LOGI(TAG, "********************************************");
        xTaskCreate(slave_monitor, "slave_monitor", 2048, NULL, configMAX_PRIORITIES - 1, NULL);
    }
    else
    {
        LED_TARGET_ERROR();
    }

    vTaskDelete(NULL);
}
